In [8]:
import pandas as pd
import numpy as np

In [9]:
prices = pd.read_csv('prices.csv')
prices['updated_at'] = pd.to_datetime(prices['updated_at'])
prices['ordered_at'] = prices['updated_at']
prices = prices.sort_values('ordered_at')
prices.head(3)

   product_id  old_price  new_price          updated_at          ordered_at
4     3954203      68800      60000 2018-09-10 16:32:00 2018-09-10 16:32:00
7     3998909      19000      17000 2018-09-10 16:35:00 2018-09-10 16:35:00
0          64     270000     239000 2018-09-10 16:37:00 2018-09-10 16:37:00

In [10]:
sales = pd.read_csv('sales.csv')
sales["ordered_at"] = pd.to_datetime(sales['ordered_at'])
sales = sales.sort_values('ordered_at')
sales.head(3)

    product_id          ordered_at  quantity_ordered
86     3954203 2018-09-11 01:43:00                 1
28     4085861 2018-09-11 06:26:00                 1
26     4085861 2018-09-11 06:53:00                 1

In [11]:
df = pd.merge_asof(sales, prices, on='ordered_at', by='product_id', direction='nearest')
df.head(5)

,product_id,ordered_at,quantity_ordered,old_price,new_price,updated_at
0,3954203,2018-09-11 01:43:00,1,68800,60000,2018-09-10 16:32:00
1,4085861,2018-09-11 06:26:00,1,60000,53500,2018-09-11 08:51:00
2,4085861,2018-09-11 06:53:00,1,60000,53500,2018-09-11 08:51:00
3,4085861,2018-09-11 08:24:00,1,60000,53500,2018-09-11 08:51:00
4,4085861,2018-09-11 09:30:00,1,60000,53500,2018-09-11 08:51:00

In [12]:
df['actual_price'] = np.where(df['ordered_at'] >= df['updated_at'], df['new_price'], df['old_price'])
df["total_price"] = df.quantity_ordered * df.actual_price
df.head(5)

,product_id,ordered_at,quantity_ordered,old_price,new_price,updated_at,actual_price,total_price
0,3954203,2018-09-11 01:43:00,1,68800,60000,2018-09-10 16:32:00,60000,60000
1,4085861,2018-09-11 06:26:00,1,60000,53500,2018-09-11 08:51:00,60000,60000
2,4085861,2018-09-11 06:53:00,1,60000,53500,2018-09-11 08:51:00,60000,60000
3,4085861,2018-09-11 08:24:00,1,60000,53500,2018-09-11 08:51:00,60000,60000
4,4085861,2018-09-11 09:30:00,1,60000,53500,2018-09-11 08:51:00,53500,53500

In [13]:
product_type = df.groupby("product_id", as_index=False)["total_price"].sum()
print(product_type)
#Tổng tiền thực tế của từng loại sản phẩm theo product_id

   product_id  total_price
0          64       956000
1     3954203       877500
2     3998909       280500
3     4085861      8247500

In [14]:
total_revenue = df.total_price.sum()
print(total_revenue)
#Tổng doanh thu của tất cả sản phẩm trong kỳ

10361500